package lessons.spring.second;
/*
1.[X] - Разобраться с примером проекта на Spring MVC;
2.[X] - Создать класс Товар (Product), с полями id, title, cost;
3.[X] - Товары необходимо хранить в репозитории (класс, в котором в виде List<Product> хранятся
товары). Репозиторий должен уметь выдавать список всех товаров и товар по id;
4.[X] - Сделать форму для добавления товара в репозиторий и логику работы этой формы;
5.[X] - Сделать страницу, на которой отображаются все товары из репозитория.
 */
public class App {

}
